avnet-iotconnect/iotc-stm32-n6-demos/Projects/instance_segmentation/STM32N6/Src/main.c
static void IAC_Config(void)
{
/* Configure IAC to trap illegal access events */
  __HAL_RCC_IAC_CLK_ENABLE();
  __HAL_RCC_IAC_FORCE_RESET();
  __HAL_RCC_IAC_RELEASE_RESET();
}

void IAC_IRQHandler(void)
{
  while (1)
  {
  }
}

/**
* @brief Display Neural Network output classification results as well as other performances informations
*
* @param p_postprocess pointer to postprocessing output
* @param inference_ms inference time in ms
*/
static void Display_NetworkOutput(iseg_postprocess_out_t *p_postprocess, uint32_t inference_ms)
{
  iseg_postprocess_outBuffer_t *rois = p_postprocess->pOutBuff;
  uint32_t nb_rois = p_postprocess->nb_detect;
  int ret;

  ret = HAL_LTDC_SetAddress_NoReload(&hlcd_ltdc, (uint32_t) lcd_fg_buffer[lcd_fg_buffer_rd_idx], LTDC_LAYER_2);
  assert(ret == HAL_OK);

  /* Draw post processing result */
  UTIL_LCD_FillRect(lcd_fg_area.X0, lcd_fg_area.Y0, lcd_fg_area.XSize, lcd_fg_area.YSize, 0x00000000); /* Clear previous boxes */
  for (int32_t i = 0; i < nb_rois; i++)
  {
    /* Display mask */
    for (int x = 0; x < AI_YOLOV8_SEG_PP_MASK_SIZE; x++)
    {
      for (int y = 0; y < AI_YOLOV8_SEG_PP_MASK_SIZE; y++)
      {
        if (rois[i].pMask[y * AI_YOLOV8_SEG_PP_MASK_SIZE + x] > 0.1f)
          UTIL_LCD_FillRect((uint32_t) lcd_bg_area.X0 + x * lcd_bg_area.XSize / AI_YOLOV8_SEG_PP_MASK_SIZE,
                            (uint32_t) lcd_bg_area.Y0 + y * lcd_bg_area.YSize / AI_YOLOV8_SEG_PP_MASK_SIZE,
                            (uint32_t) lcd_bg_area.XSize / AI_YOLOV8_SEG_PP_MASK_SIZE + 1,
                            (uint32_t) lcd_bg_area.YSize / AI_YOLOV8_SEG_PP_MASK_SIZE + 1,
                            colors[i % NUMBER_COLORS] & 0x40ffffff);
      }
    }
  }
  for (int32_t i = 0; i < nb_rois; i++)
  {
    /* Display box */
    uint32_t x0 = (uint32_t) ((rois[i].x_center - rois[i].width / 2) * ((float32_t) lcd_bg_area.XSize)) + lcd_bg_area.X0;
    uint32_t y0 = (uint32_t) ((rois[i].y_center - rois[i].height / 2) * ((float32_t) lcd_bg_area.YSize));
    uint32_t width = (uint32_t) (rois[i].width * ((float32_t) lcd_bg_area.XSize));
    uint32_t height = (uint32_t) (rois[i].height * ((float32_t) lcd_bg_area.YSize));
    /* Draw boxes without going outside of the image */
    x0 = x0 < lcd_bg_area.X0 + lcd_bg_area.XSize ? x0 : lcd_bg_area.X0 + lcd_bg_area.XSize - 1;
    y0 = y0 < lcd_bg_area.Y0 + lcd_bg_area.YSize ? y0 : lcd_bg_area.Y0 + lcd_bg_area.YSize  - 1;
    width = ((x0 + width) < lcd_bg_area.X0 + lcd_bg_area.XSize) ? width : (lcd_bg_area.X0 + lcd_bg_area.XSize - x0 - 1);
    height = ((y0 + height) < lcd_bg_area.Y0 + lcd_bg_area.YSize) ? height : (lcd_bg_area.Y0 + lcd_bg_area.YSize - y0 - 1);
    UTIL_LCD_DrawRect(x0, y0, width, height, colors[i % NUMBER_COLORS]);
    UTIL_LCDEx_PrintfAt(x0, y0, LEFT_MODE, classes_table[rois[i].class_index]);

    //IOTCONNECT record the object three times
    if (sizeof(classes_table[rois[i].class_index]) < 30) {
      if (count == 0) {
    	strcpy(object_name, classes_table[rois[i].class_index]);
      }
      if (count == 1) {
        strcpy(object_compare, classes_table[rois[i].class_index]);
      }
      if (count == 2) {
        strcpy(object_compare_again, classes_table[rois[i].class_index]);
      }
      	count++;
      } else {
        strcpy(object_name, "");
        strcpy(object_compare, "");
        strcpy(object_compare_again, "");
        count = 0;
      }
  }

  UTIL_LCD_SetBackColor(0x40000000);
  UTIL_LCDEx_PrintfAt(0, LINE(2), CENTER_MODE, "Objects %u", nb_rois);
  UTIL_LCDEx_PrintfAt(0, LINE(20), CENTER_MODE, "Inference: %ums", inference_ms);
  UTIL_LCD_SetBackColor(0);

  Display_WelcomeScreen();

  SCB_CleanDCache_by_Addr(lcd_fg_buffer[lcd_fg_buffer_rd_idx], LCD_FG_FRAMEBUFFER_SIZE);
  ret = HAL_LTDC_ReloadLayer(&hlcd_ltdc, LTDC_RELOAD_VERTICAL_BLANKING, LTDC_LAYER_2);
  assert(ret == HAL_OK);
  lcd_fg_buffer_rd_idx = 1 - lcd_fg_buffer_rd_idx;

  //IOTCONNECT send data to cloud
  uint32_t current_time = HAL_GetTick();
  if ((current_time - last_send_time) < IOTC_INTERVAL) {
    return;
  }
  //send messages to iotconnect every IOTC_INTERVAL
  last_send_time = current_time;

  //If the object are the same in the previous three records, we send data to iotconnect.
  if (count >= 2) {
    if (strcmp(object_name, object_compare) == 0 && strcmp(object_name, object_compare_again) == 0) {
      printf("Sending the message to IOTCONNECT...\r\n");
	  da16k_at_send_formatted_raw_no_crlf("AT+NWICMSG object,%d,inference,%d,class,%s\r\n",nb_rois, inference_ms, object_name);
    }

    //clear and compare again
    strcpy(object_name, "");
    strcpy(object_compare, "");
    strcpy(object_compare_again, "");
	count = 0;
  }

  //IOTCONNECT to receive C2D message
  da16k_cmd_t current_cmd = {0};
  if ((da16k_get_cmd(&current_cmd) == DA16K_SUCCESS) && current_cmd.command) {
	  //USE current_cmd.command & current_cmd.parameters here
	  printf("/IOTCONNECT command is %s\r\n",current_cmd.command);
	  if (current_cmd.parameters) {
		printf("/IOTCONNECT command->parameter is %s\r\n",current_cmd.parameters);
		da16k_at_send_formatted_raw_no_crlf("AT+NWICMSG iotc_cmd,%s,iotc_cmd_parameter,%s\r\n", current_cmd.command, current_cmd.parameters);
	  }
      da16k_destroy_cmd(current_cmd);
  }
}

static void LCD_init()
{
  BSP_LCD_Init(0, LCD_ORIENTATION_LANDSCAPE);

  /* Preview layer Init */
  LayerConfig.X0          = lcd_bg_area.X0;
  LayerConfig.Y0          = lcd_bg_area.Y0;
  LayerConfig.X1          = lcd_bg_area.X0 + lcd_bg_area.XSize;
  LayerConfig.Y1          = lcd_bg_area.Y0 + lcd_bg_area.YSize;
  LayerConfig.PixelFormat = LCD_PIXEL_FORMAT_RGB565;
  LayerConfig.Address     = (uint32_t) lcd_bg_buffer;

  BSP_LCD_ConfigLayer(0, LTDC_LAYER_1, &LayerConfig);

  LayerConfig.X0 = lcd_fg_area.X0;
  LayerConfig.Y0 = lcd_fg_area.Y0;
  LayerConfig.X1 = lcd_fg_area.X0 + lcd_fg_area.XSize;
  LayerConfig.Y1 = lcd_fg_area.Y0 + lcd_fg_area.YSize;
  LayerConfig.PixelFormat = LCD_PIXEL_FORMAT_ARGB4444;
  LayerConfig.Address = (uint32_t) lcd_fg_buffer; /* External XSPI1 PSRAM */

